["<UNK>", "<BOS>", "<EOS>", " ", "0", "1", "10", "12", "2", "3", "4", "5", "6", "7", "8", "9", "ALL", "Action", "Add", "Adjacent", "Amount", "Ancestral", "Ancient", "And", "Apprentice", "Arcane", "Argent", "Armor", "Ashbringer", "Assassin", "Attack", "Attribute", "Aura", "Awakens", "Axe", "BEAST", "Bandit", "Baron", "Battle", "Battlecry", "Bear", "Berserker", "Bird", "Black", "Blade", "Blast", "Blessing", "Block", "Blood", "Bloodhoof", "Bloodsail", "Bluegill", "Boar", "Bolt", "Boom", "Bot", "Both", "Bounce", "Brewmaster", "Buff", "CARD_RARITY", "CARD_SOURCE", "CHARACTER_CLASS", "COMMON", "Call", "Cannon", "Cant", "Captain", "Card", "Cast", "Cat", "Champion", "Change", "Character", "Charge", "Chicken", "Choice", "Claw", "Cleric", "Clockwork", "Cobra", "Coin", "Coldlight", "Commander", "Control", "Core", "Corsair", "Cost", "Count", "Creeper", "Current", "DEMON", "DRAGON", "DREAM", "DRUID", "Damage", "Damaged", "Dark", "Dead", "Death", "Deathrattle", "Defias", "Demonfire", "Destroy", "Did", "Died", "Dispel", "Divine", "Dragon", "Dragonling", "Drake", "Draw", "Dread", "Dream", "Druid", "Duplicate", "Durability", "EPIC", "Effect", "Egg", "Einhorn", "Elemental", "Emerald", "Emperor", "Ended", "Enemy", "Equal", "Equip", "Excess", "Explosive", "FREE", "False", "Fang", "Fel", "Feugen", "Finkle", "Fire", "Flame", "Force", "Form", "Frog", "Frost", "Frozen", "Fury", "Gallywix's", "Gang", "Ghoul", "Giant", "Give", "Gnome", "Goblin", "Golem", "Graveyard", "Greater", "Grim", "Grimscale", "Grove", "Guardian", "HUNTER", "Hand", "Has", "Heal", "Healing", "Health", "Hero", "Holy", "Hound", "Huffer", "Hunter", "Hyena", "Ice", "Image", "Immune", "Imp", "In", "Increase", "Inner", "Iron", "Is", "Jaraxxus", "Justice", "Kill", "King", "Kings", "Knight", "LEGENDARY", "LIST", "Lance", "Laughing", "Lava", "Leokk", "Leper", "Life", "Light", "Lightning", "Lord", "MAGE", "MECH", "MINION_TYPE", "MURLOC", "Mad", "Mage", "Mana", "Mark", "Master", "Mechanical", "Might", "Mind", "Minion", "Mirror", "Misha", "Moonfire", "Murloc", "Name", "Nature", "Nerubian", "Nightmare", "None", "Not", "Nova", "Of", "Ogre", "One", "Ooze", "Opponent", "Oracle", "PALADIN", "PIRATE", "PRIEST", "Pain", "Panther", "Patron", "Picker", "Placed", "Played", "Player", "Poison", "Power", "Priestess", "Puddlestomper", "Query", "RARE", "ROGUE", "Rage", "Ragnaros", "Raider", "Random", "Reaper", "Recruit", "Remove", "Replace", "Resurrect", "SHAMAN", "Scout", "Secret", "Seeds", "Seer", "Selector", "Self", "Shadow", "Sheep", "Shield", "Shock", "Shot", "Silence", "Silver", "Sister", "Snake", "Southsea", "Spectral", "Spell", "Spellbender", "Spider", "Spike", "Spirit", "Squire", "Stalagg", "Started", "Stealth", "Stoneclaw", "Summon", "Summoned", "TOTEM", "Tag", "Tank", "Target", "Taunt", "Thaddius", "Than", "The", "Tidecaller", "Tidehunter", "To", "Totem", "Transform", "Trap", "Treant", "Trogg", "True", "Turn", "Type", "Unstable", "Until", "Used", "User", "Violet", "Volcanic", "WARLOCK", "WARRIOR", "Warleader", "Warrior", "Weapon", "Whelp", "Whirling", "Wild", "Windfury", "Wisps5", "With", "Wolf", "Worthless", "Wrath", "Yeti", "Young", "Ysera", "_", "__init__", "_reveal", "activate", "add_buff", "add_effect", "agent", "amount", "append", "attack", "attacker", "auras", "battlecry", "bind", "bounce", "buffs", "c", "calculate_attack", "calculate_max_health", "can_use", "card", "card_drawn", "card_played", "cards", "cards_played", "change_attack", "change_temp_attack", "character", "character_attack", "characters", "charge", "check_delayed", "choices", "choose_option", "chosen_card", "combo", "condition", "conditions", "copy", "create_minion", "create_weapon", "current_player", "damage", "deactivate", "deathrattle", "deck", "demon_card", "die", "divine_shield", "draw", "draw_player", "drawn", "effective_heal_power", "effective_spell_damage", "effects", "enrage", "extend", "filter_func", "find_enemy_minion_battlecry_target", "find_enemy_minion_spell_target", "find_friendly_minion_spell_target", "find_minion_spell_target", "find_spell_target", "frog", "game", "hammer", "hand", "heal", "health", "hearthbreaker", "hearthbreaker.cards.minions.druid", "hero", "hunter", "i", "immune", "increase_armor", "increase_health", "index", "is_minion", "isinstance", "justice", "left_minion", "len", "lightwarden", "m", "mana", "minion", "minion_card", "minion_died", "minion_played", "minion_type", "minions", "mirror", "new_card", "new_minon", "of", "opponent", "option", "other_player", "overload", "p", "picker", "player", "players", "power", "powers", "query", "random_choice", "random_draw", "range", "reduce_cost", "remove", "reveal", "right_minion", "self", "set_health_to", "source", "source_list", "spare_part_list", "spell_damage", "spell_targetable", "stealth", "summon", "super", "t", "target", "target_func", "targeting", "targets", "taunt", "temp_attack", "the", "trigger", "type", "unbind", "use", "value", "weapon", "windfury", "wrath", "x"]