["<UNK>", "<BOS>", "<EOS>", "#", "$", "%", "'re", "'s", "(", ")", "+1", "+1/+1", "+2", "+2/+2", "+3", "+3/+3", "+4", "+5", "+5/+5", ",", "-", "-1", ".", "0", "1", "1/1", "10", "12", "15", "2", "2/1", "2/2", "3", "4", "5", "50", "6", "7", "8", "9", ":", ";", "</atk>", "</cost>", "</def>", "</dur>", "</name>", "</player-cls>", "</race>", "</rarity>", "</type>", "<atk>", "<cost>", "<def>", "<dur>", "<name>", "<player-cls>", "<race>", "<rarity>", "<type>", "ALL", "Add", "Adjacent", "Ancestral", "Ancient", "Apprentice", "Arcane", "Argent", "Armor", "At", "Attack", "Axe", "Battle", "Battlecry", "Beast", "Beasts", "Blessing", "Blood", "Boar", "Boom", "Ca", "Champion", "Change", "Charge", "Choose", "Claw", "Combo", "Common", "Costs", "Crystal", "Damage", "Dark", "Deal", "Deathrattle", "Defias", "Demon", "Destroy", "Divine", "Dragon", "Dragonling", "Drake", "Draw", "Dream", "Druid", "Durability", "Elemental", "Enrage", "Epic", "Equip", "Feugen", "Flame", "Free", "Freeze", "Frost", "Gain", "Gallywix", "Giant", "Give", "Gnome", "Golem", "Guardian", "Hand", "Has", "Healing", "Health", "Hero", "Holy", "Hunter", "Ice", "If", "Immune", "Imp", "Jaraxxus", "King", "Knight", "Legendary", "Light", "Lightning", "Lord", "Mage", "Mana", "Master", "Mech", "Mechanical", "Mechs", "Mind", "Minion", "Mirror", "Murloc", "Murlocs", "NIL", "NL", "Nerubian", "Neutral", "Ogre", "One", "Overload", "Paladin", "Part", "Pirate", "Power", "Powers", "Priest", "Put", "Rare", "Restore", "Return", "Rogue", "Secret", "Shadow", "Shaman", "Shield", "Shot", "Shuffle", "Silence", "Silver", "Spare", "Spell", "Spirit", "Squire", "Stalagg", "Stealth", "Summon", "Take", "Taunt", "Thaddius", "The", "This", "Totem", "Transform", "Treant", "Treants", "Violet", "Warlock", "Warrior", "Weapon", "Whelp", "When", "Whenever", "Windfury", "Wolf", "Wrath", "Your", "Ysera", "a", "add", "all", "among", "an", "and", "another", "any", "as", "at", "attack", "attacks", "battlefield", "be", "by", "card", "cards", "cast", "casts", "chance", "character", "characters", "control", "copy", "cost", "costs", "damage", "damaged", "deal", "deck", "destroy", "died", "dies", "draw", "draws", "each", "empty", "end", "enemies", "enemy", "equal", "for", "friendly", "from", "full", "gain", "game", "give", "hand", "has", "have", "hero", "holding", "in", "instead", "into", "is", "it", "its", "less", "minion", "minions", "more", "n't", "next", "of", "on", "one", "only", "opponent", "or", "other", "owner", "play", "player", "plays", "put", "random", "randomly", "restore", "spell", "spells", "split", "start", "summon", "takes", "target", "targeted", "that", "the", "their", "them", "this", "three", "to", "turn", "two", "until", "weapon", "while", "with", "wrong", "you", "your"]